[{"author": "presti-ravioli", "title": "Depression for me is a constant feeling of wanting to go home, but no matter where I am, I am never home. Even when I’m at my physical home.", "text": "It’s a constant sense of wanting to go somewhere else. I’d feel better if i was at this place. Then you go there and then it’s the same exact feeling, just in a different physical location. \n\nI feel mentally homeless and I just want to go home.\n\n\nEdit: I didn’t think this would get traction and that’s my first gold. Thanks buddy."}, {"author": "niszi", "title": "Depression is so much worse if you live with your parents.", "text": "I can't hide, I can't cry out loud, they don't understand me if I can't clean my room or can't go out. They watch me fall apart and criticise me while it happens."}, {"author": "anonymous", "title": "A stranger just saved my life...", "text": "I woke up today wanting to die. I was planning on doing it after school so I decided school was pointless to go to. I walked to the mall by my school and went to a Kneader's and ordered french toast. French toast has always been my favorite so I figured it would be a good last thing to eat. I pondered a ton about my life and what it is I really want. I felt super empty but also my mind was racing with thoughts. I had convinced myself I needed to finish my life today. I had been thinking for about half an hour when an elderly man sat across from me and gave me a hot chocolate. He said that he ordered it for me because he could tell I needed it. He told me \"I don't know what you're going through, but life will get better.\" And then he left. And then I cried. And now I'm back at school, and I think I want to live. \n\nEdit: Thank you to everyone who responded to this and messaged me and just were so kind. <3 "}, {"author": "fallen-fawn", "title": "Shout out to the particular hell that is functional depression.", "text": "This is me. Don’t get me wrong, it’s better than don’t-leave-my-bed-for-a-week depression. I am grateful I can be an independent person. But there is something uniquely horrible about being able to go to work every day, occasionally clean up after yourself, pay your bills, generally put yourself together enough to look like a human being... but that’s it. Nothing else. No social life. No hobbies. Constantly battling your mind. And being absolutely fucking exhausted all the time."}, {"author": "Whiteelchapo", "title": "Does anyone ever feel okay for a while, then a wave of depression just hits you like a truck?", "text": "Recently I thought I was beginning to feel better. Not quite happy, but just sort of... I don’t know, content? But my depression always seems to come back, sometimes stronger than others. This has happened in the past too. I’m worried that one day the gust of depression will blow too strongly and the branch i’m hanging onto will snap. Or maybe not. That could just be the apathy speaking though. Anybody else really frustrated by this? It feels like i’m always walking a razors edge between being fine, and being depressed and one misstep causes me to lose my balance. Ugh. \n\nEdit: evidently, there are quite a few people who experience similar feelings. I just want to say that it makes me happy in a sad sort of way to know that we are all going through something similar in our lives. It makes things less lonely."}, {"author": "anonymous", "title": "I was going to kill myself tonight", "text": "I wrote a suicide note earlier in the morning. I spent most of the day doing things that used to make me happy: getting coffee, walking in the park, listening to music, etc. I ate my “last meal” while listening to Bob Marley.\n\nAbout an hour before I was going to kill myself, my friend from college messaged me and asked to play Xbox. We ended up reminiscing on good times, and laughing our asses off. It felt nice to feel like somebody cared about me. We’re planning on playing tomorrow too.\n\nI don’t feel as bad as I did earlier today and I also am glad that I didn’t kill myself.\n\nEdit: thank you for the gold, friend:)\n\nEdit: thank you for the silver, friend:) I’m currently sitting at a coffee shop, reading all the kind messages everyone has sent. It means a lot to me"}, {"author": "mynormalheart", "title": "\"Depression isn't always at 3am when you're alone with only the thoughts in your head. Sometimes it's at 3pm, when you're surrounded by friends in the middle of laughing.\" This is high functioning depression. So many people don't get it.", "text": "I look normal on the outside, but that's because I try very hard to."}, {"author": "Jadenent0623", "title": "Living with depression is like running a marathon with a broken leg and then having everyone run past you and say “Yeah, yeah, broken leg boo-hoo, we’re all tired.” And then run the same fucking race everyday. The cycle.", "text": "You’re depressed!\n\nYou’re okay, it’ll take time, but you’re okay!\n\nWhat the hell is taking so long, life blows, you’re depressed again!\n\nYou woke up and got dressed today, it’s looking up from here?\n\nSIKE, you fucking idiot, did you truly believe your depression was done with you? You’re dumber than you lead yourself to believe!\n\nOkay, we’re okay, we’re gonna make it. I just gotta stay strong.\n\nOop, you fucked up once today, I’m dragging your ass back into the dark. \n\nOVER AND OVER AND OVER! \n\nIs there really only one way out? I don’t know if I wanna die, I got a brother who may need me one day. I’m tired. So tired, man."}, {"author": "SociallyAdeptt", "title": "I want to be alone, but not lonely. I want friends but hate socializing. Want success, but have no desire to be productive. I’m lost in my own conscience.", "text": "Thank you all for the supportive messages. It’s heartwarming to know that I’m not alone. I know we can all get through this together. I love each and every single one of you "}, {"author": "butteredgrapes", "title": "Does anyone else stay up super late to avoid the next day?", "text": "I don’t know if that makes sense. What I mean is that I stay up as late as possible wasting time because I know that if I go to sleep, I’ll wake up and have to go to school. I usually go to bed at around 3:30am and get up at 6am and it’s destroying me, I’ve been doing this for months and I’m physically weak and exhausted constantly because of it but my depression and anxiety demand it. And they always seem to get their way. \n\nEdit: I’m really glad that this spoke to so many people, it feels good knowing I’m not alone. Sending lots of love to you all. This isn’t easy but I believe in you ❤️"}, {"author": "Tastylicious", "title": "I wouldn't commit suicide but if I had an option to suddenly stop existing I would choose it", "text": "Does anyone else feel this way?  This has been crossing my mind a lot lately\n\nEDIT: I just want to thank everyone for the thoughtful, kind comments I've been recieving.  It's been a nice change and I really appreciate it.  You guys are the best.  :)"}, {"author": "coolmast3r", "title": "If 10 years ago someone told me that in 10 years I would be routinely sitting in my room all day doing nothing to make myself a successful man but eat, sleep and use my phone/pc and sometimes go out for a lonely aimless walks, I would never believe them", "text": "But here I am, 24 years old man and doing exactly that."}, {"author": "NobleChris2", "title": "Had anyone noticed memory decline from depression?", "text": "Just curious if anyone else affected by this problem also noticed quite a big cognitive decline. Or if anyone has noticed a cognitive decline and managed to build themselves back up to that previous cognitive level."}, {"author": "NordyNed", "title": "Do you ever just stop dead in the middle of whatever you're doing and feel a great wave of existential dread/self-hatred", "text": "Happens to me a lot. Cooking, walking to class, brushing my teeth...sometimes I just stop for like a minute, feel a tremendous sense of self-hatred and suicidal ideation, and then continue on as if nothing ever happened."}, {"author": "LilBluSmurf", "title": "I came out to my family as lesbian. Mom told me I should go kill myself.", "text": "17 F\nAll my life I've lived in a small little \"redneck\" town in North Carolina with conservative parents. My Dad is a pastor at our local church and both of my parents are EXTREMELY religious. They both hate gay people. I've known I was gay since I was a child but have always been scared about coming out in fear that they would reject me because they are very homophobic people. Whenever my parents see someone gay on TV they always say things like \"Look at that fucking faggot\" or \"That's disgusting\" and it just breaks my heart. I hate living with those fucking homophobes and I always take out my hatred by cutting myself. So far I've cut around 30 scars all over my thighs, butt, legs, and lower back. No one has ever seen these scars because I always wear jeans to cover them. At least not until a few days ago.\n\nWe were having a baby shower for my cousin and my mom insisted I wear a short ugly little dress that comes up to about my lower thigh. You could see every single fucking scar on my legs. I tried my best to cover the scars with my arms but when I stood up after dinner she saw them. She pointed at my legs and asked me what the hell is that so I told her everything. About how depressed I've been. About how many times I've contemplated suicide over the last few months. And about how I'm a lesbian. \n\nMy parents flipped the fuck out.\n\nMy dad started screaming a bunch of religious shit while throwing food at me. He told me that being gay was a sin and I was going to hell for this. He told me he didn't want \"no faggot daughter\". Then he angrily stomped out the room. My mom just looked at me in disgust for a few minutes before she spoke. She said, and these are her exact words, \"Just kill yourself you gay little bitch, you're not my daughter anymore.\"\n\nThat's all. She just said that and walked out.\n\nIt's been two days since that happened and now my parents refuse to talk to me. When they see me around the house they just ignore me like I'm not even there.\n\nI hate my life. So much.\n\nEDIT: Omg thank you guys for all the nice comments!!! I'm turning 18 next week so I'll probably be moving out then."}, {"author": "Conurekid", "title": "Anyone else ever feel like the “old you” died years ago, and now you’re just limping along as someone you really can’t stand?", "text": "Like, the old me wasn’t even that great either but damn "}, {"author": "SoulfulYam", "title": "Does anyone else get extremely bummed out seeing people younger than them doing more with their life?", "text": "I hate being told: \"It'll get better when you're older.\" No it fucking won't. I've waited for over a decade for things to get better & they haven't. It's especially not true when I see people younger than me living better, happier, & more interesting lives. Clearly that means I'm a failure & I just can't properly do this game we call life.\n\nJust today someone I know who's younger than me just managed to find their own apartment with their SO. I can't do that now & if that doesn't scream that I'm a pathetic loser, I don't know what does."}, {"author": "luxcsia", "title": "Becoming a regular at a local coffee shop changed my life", "text": "I was depressed, failing school, etc and I decided I should do my homework at a coffee shop one day. I went in and the owner was super nice and asked me if I wanted to join the rewards program and I was really craving community at this point and I was super excited. \nI kept coming back to the shop to do my homework and the owner and the baristas would always welcome me and they were always happy to see me. I started to get to know everybody there very well and now I consider them all friends. \nI found that when depressed having different communities helps a lot, and it turns out a lot of the other regulars at coffee shops also are depressed or have other mental illnesses. \nA two dollar drink can let you stay there for a few hours and by being nice to everyone around you and being somewhat productive on work it can be a really great place to have"}, {"author": "Hellblade999", "title": "Does anyone have a period where they feel really motivated and see things clearly, only to crash even harder the more you try to better yourself, feeling even more depressed than you were originally?", "text": "It feels like the harder I try to better myself, the harder it pushes back."}, {"author": "Nyx13Love", "title": "does anyone else have a constant feeling of not fitting in or belonging anywhere?", "text": "i feel this way around everyone, friends, family, coworkers, anywhere i go. i just always feel like i’m in the background. but at the same time i like going unnoticed so i don’t have to talk to anyone and be in the spotlight.."}]