[{"id": 40063395, "text": ["#FreeEducationFriday Parents can use media to open up conversations about suicide prevention with youth. We've put together this blog to help you get started. https://t.co/TXv5XHqNbW #endstigma #suicidepreventionmonth https://t.co/BjidACfTVg", "We're so excited for @ThisIsMyBrave 's show in Brentonville, AR on Thursday, Oct. 9 from 7-9pm! RSVP to their show about #MentalHealth storytelling and art! https://t.co/hXIGtQ9kRp https://t.co/KSbX4sQ1pn", "\"We are incredibly proud that one of our longest-serving Teen Speakers, Elizabeth Keeling, was chosen for a 2019 Myra Kraft Community Award from the #NewEnglandPatriots Foundation! \" Read more https://t.co/IMCd0gWEwI https://t.co/AHJ3VCImVA", "Did you miss our September Newsletter? Sign up for our newsletter so you don't miss another and check our the most recent edition here --&gt; https://t.co/fVFgtAdiaa #SPM19 https://t.co/dzLdMxNaTv", "@MrsHallOMS Thank you for such positive feedback, Mrs. Hall! So glad to have you as a supporter! #familyaware #endstigma", "We're going LIVE in 1 hour! Register now to join us live for our free Recognizing and Managing #TeenAnxiety webinar. Can't stay the whole time? #SPM19 Don't worry, we'll send a recorded copy after it airs! https://t.co/xNRqS5e3e1 https://t.co/Gskw6RX6jI", "#SuicidePrevention #SPM19 How are you making a difference this Suicide Prevention Awareness Month. Take a simple action by sharing these numbers with your friends and family. Spread the word, there is always someone who will take your call. #bettertogether https://t.co/a1f37F1fNP", "Our free Recognizing and Managing Teen Anxiety webinar airs lives tomorrow, 9/25 at 7pm ET! Register today and join us tomorrow. Can't join live? Submit your questions and we'll send you a recorded version after it airs. https://t.co/xNRqS5e3e1 https://t.co/xqtJcNqWa3", "#SuicidePreventionMonth \"A nationally representative study of adolescents in grades 7–12 found that lesbian, gay, and bisexual youth were more than twice as likely to have attempted suicide as their heterosexual peers.\" https://t.co/l9WppUqdHp https://t.co/lEJn2cqeAL", "We're kicking off the school year with peer to peer Teen Speaker events about depression Massachusetts! Learn more and see how you can bring us to your Massachusetts community. @FFMW https://t.co/a8iExKpxkw https://t.co/Rzs10zBZV7"], "media": ["http://pbs.twimg.com/media/EFfjRkzWkAEVu8t.png", "http://pbs.twimg.com/media/EFfAfwsWkAIvyv4.jpg", "http://pbs.twimg.com/media/EFbCl7kXUAA0_qY.jpg", "http://pbs.twimg.com/media/EFZwUW6XoAAKBLX.png", null, "http://pbs.twimg.com/media/EFV5C2tXsAMu5aU.jpg", "http://pbs.twimg.com/media/EFULQGfXoAAQOGc.jpg", "http://pbs.twimg.com/media/EFQGkpBXsAAVmkA.jpg", "http://pbs.twimg.com/media/EFLlziLXoAA5uww.png", "http://pbs.twimg.com/media/EFEuSkFWwAAllFd.jpg"]}, {"id": 3890381963, "text": ["#Depression can make our existing burdens feel much heavier. Take the time to work through them and remember that they don't define you: https://t.co/l1KXGSrwGN", "Sadness is a symptom of #depression. Here are some tips on how to challenge the negative thoughts that feed depression: https://t.co/or75ynK9YZ", "It's okay to not be okay. But if you are #livingwithdepression, your condition can often be misinterpreted as just mood swings. What do you usually say when people ask you what’s wrong? https://t.co/TUwN7iZQaH", "#LivingWithDepression can feel like wearing glasses with grey lenses. But remember that the colours can come back: \nhttps://t.co/OEYMO6Zzrk", "@X_P3T3R918_X Dear @X_P3T3R918_X. We are truly sorry to hear that you feel this way. Those thoughts are not uncommon when living with depression. Please reach out and talk to your doctor or someone you trust, and please take good care of yourself.", "Getting out of bed and taking that morning shower can give you a burst of energy to tackle #depression head-on. When #livingwithdepression, remember to celebrate your daily victories – even the small ones. #RethinkDepression https://t.co/V9xmUxihyn", ": https://t.co/NXVaid19og", "It can be difficult to explain #depression to people that haven't had it. Read Erika's beautiful explanation that explains how depression can feel like living in a hole:\nhttps://t.co/a4qt7wIbq7", ": https://t.co/g2MlVZ0orF", "@LiamSmi24604200 @SickNotWeak Dear @LiamSmi24604200. We're truly sorry to hear that you feel this way. We understand how hard socializing can be if you are living with depression. Do you have someone you trust you can talk to? Please take good care of yourself."], "media": [null, null, "http://pbs.twimg.com/media/EEaPHwvWsAghBmG.png", null, null, "http://pbs.twimg.com/media/EEAs1TPXkAIdV03.jpg", null, null, "http://pbs.twimg.com/media/DraN6qwXgAAOwzp.jpg", null]}, {"id": 36130058, "text": ["\"People driven to distraction by politics can undertake some proven methods of stress relief like exercise, eating right, getting good sleep, and enjoying time with family and friends.\" -Depression Center associate director and @APAPsychiatric past president Dr. Michelle Riba https://t.co/u9l3HultQa", "Great to see the TRAILS program in action under the leadership of @ElizabethTRAILS ! https://t.co/SiJQcarSh7 https://t.co/sxzIseHC6b", "Happening next Tuesday night at @aadl! Come learn about the relationship between sleep and mental health. https://t.co/4IsT7LLS1l", ": NEW: How did #Medicaid expansion in #Michigan affect the health &amp; work of people with #behavioralhealth conditions, including…", ": Tuesday (October 1) at 7pm, head downtown to learn more about the impact of sleep on mental health with Dr. J. Todd Arnedt of the…", ": This Friday, @emilymprovost &amp; Professor of Bipolar Disorder and Depression Melvin McInnis weigh in on artificial intelligence…", "Today at 5:30 for ALL @UMich students⤵️ https://t.co/0CiIwZlCe7", "Hey @UMich students! Our regular #CampusMindWorks wellness groups are starting back up again tomorrow. \n\nPlease join us for a discussion on \"strategies for managing relationships\" in Angell Hall at 5:30. And see the semester's full schedule here: https://t.co/POxgYToxqR https://t.co/FHbLDMUHID", "Do you know how critical a good night's rest is to your #mentalhealth? Join us next Tuesday, Oct. 1 at the @aadl for a discussion about sleep, circadian rhythms, and your health.\n\nhttps://t.co/8X8CK6IhnB https://t.co/CTpVkVaXvI", ": \"We are entering an era with the potential for unprecedented advances through collaborative, interdisciplinary research.…"], "media": [null, null, null, null, null, null, null, "http://pbs.twimg.com/media/EFLB8-FUcAA6pNb.jpg", "http://pbs.twimg.com/media/EFKkqkKUYAAlduN.png", null]}, {"id": 60098410, "text": ["“Live the Life of Your Dreams: Be brave enough to live the life of your dreams according to your vision and purpose instead of the expectations and opinions of others.”\n― Roy T. Bennett #Quote  #Goodnight ღ #depressionforums.org", "“Never throughout history has a man who lived a life of ease left a name worth remembering.” \n― Theodore Roosevelt \n  #Quote \n #depressionforums.org", "Feeling #Insecure 6 Tips To Quiet Your Inner Critic https://t.co/admNGnQZ2o\n#Anxiety  #depressionforums.org", "“Don’t waste your time in anger, regrets, worries, and grudges. Life is too short to be unhappy.”\n― Roy T. Bennett  #Quote   #depressionforums.org", "Vraylar Launches New Campaign to Portray, #Destigmatize #bipolardisorder I \n https://t.co/e9aV01gqdS\n#Stigma #Bipolar  #depressionforums.org", "#Goodmorning ☼  “You can be anything, you want to be in this life.”\n― M.H. Rakib #Quote   #depressionforums.org", "“In the face of adversity, beautiful things emerge”\n― Epiphana Lewis  \n #Quote  #Goodnight ღ \n #depressionforums.org", "Sally Miller, PhD: The #Challenges of #bipolardepression \n https://t.co/bVfEySxSIK  via @mdmagazine#depressionforums.org", "“Life is indeed a storm and while there are times you can sit and watch from the safety of a window pane there are moments you need to grit your teeth and take on the wind and the rain.”\n― Ken Scott  #Quote   #depressionforums.org", "#Stress, #Overwork, and #Insecurity are Driving the Invisible #Workplace #Accident Rate \n https://t.co/V7jYnEd39N\n #depressionforums.org"], "media": [null, null, null, null, null, null, null, null, null, null]}, {"id": 1087002326, "text": ["“Come, let's watch the rain as it's falling down “", "I have no will to live anymore", "@sonofdemon18 Felt", "Numbness is consuming me -ga", "I haven’t felt like myself in so long I’m forgetting who I am -ga", "I feel so many things at once -ga", "I just wanna live my life not feeling like I’m broken -ga", "Please don’t leave me -ga", "There’s a war inside my mind -ga", "I’ve been going numb lately -ga"], "media": [null, null, null, null, null, null, null, null, null, null]}, {"id": 3093201981, "text": ["Depression brings out the best in some people, the worst in others.", "Sometimes you have to be your own hero.", "The best treatment for depression is ______________.", "https://t.co/UL8e56LZHc", "The only people who really seem to understand depression are the people who've already gone through it.", "RT if you need a hug; like if you give hugs.", "Some people are more certain of everything than I am of anything.\n —ROBERT RUBIN", "Today would be a good day for depression to relent.", ": “I’m telling you this because I want someone else who has gone through it to understand it’s not just them. This is a re…", "So many people feel like they've been forgotten."], "media": [null, null, null, "http://pbs.twimg.com/media/EFJcQIhXYAEGDpe.jpg", null, null, null, null, null, null]}, {"id": 633097373, "text": [": 20 years ago this summer I nearly died by suicide in Ibiza.\n\nI knew I had no future. I knew I’d never be happy again.\n\nToday…", ": We don’t always take self-harm seriously but:\n- 50% of those who die by suicide have previously self-harmed\n- suicide is…", "Just a reminder for those struggling in the uk, the @samaritans are always there to listen.  \n\nFor those outside the Uk, https://t.co/SjZIkElk2q. \n\nTalking can save lives! https://t.co/tb6BjpjXNf", ": So important to remember that depression affects everyone differently! https://t.co/WH7psHogrN", "@NicoleLindquis6 @AntiBullyingPro @ABAonline @PicoftheDay1 @MomMomandson1 @TheEllenShow @Tube4Gamers @newfriends @Needavacation2 @WaltDisneyWorld What a handsome young boy! \nHead up Christopher, you are loved more than you know!", "It’s okay if the only thing you do today is breathe! 💖\n#lookafteryourself https://t.co/t7Ks5bokJG", "You deserve so much love! https://t.co/YBK5Kpksd6", "You can help save a life.\n#LetsTalk #SuicidePrevention https://t.co/IcwYyszxW5", "You are not your illness! https://t.co/qTWfLZOkci", "We all need to prioritise our mental health, not just those who are unwell! #mentalhealthawarenessweek https://t.co/HIjj4801Ri"], "media": [null, null, "http://pbs.twimg.com/media/D9MLCTUW4AYyWbY.jpg", "http://pbs.twimg.com/media/DkWNeKKW4AEwBYz.jpg", null, "http://pbs.twimg.com/media/D8Rp715WsAAIu6O.jpg", "http://pbs.twimg.com/media/D8FYc5EWwAo8F8o.jpg", "http://pbs.twimg.com/media/D7_hZ3qW4AAchhj.jpg", "http://pbs.twimg.com/media/D7ButWyWkAUesaG.jpg", "http://pbs.twimg.com/media/D6inkXaXsAA2ftP.jpg"]}, {"id": 20227045, "text": ["【SOMETIMES YOU JUST HAVE TO STAND ALONE】 \n@depressionloh in DEPRESSION  \n_\n#DEPRESSIONTRIBE \n#DEPRESSIONVOL4 \n#NOTANATHLETE https://t.co/dAyHrnnPOz", "://t.co/sJHru9RXD9", "【CLOTHES HAVE NO GENDER】 \nanxiousarachnid in DEPRESSION \n_\n#DEPRESSIONTRIBE \n#DEPRESSIONVOL2 \n#DRAGONVSTIGER https://t.co/lTvnIOlHzD", "【DARKNESS LIVES IN ME】 \nmay.mmnn in DEPRESSION \n_\n#DEPRESSIONTRIBE \n#DEPRESSIONVOL3 \n#MONSTERSAMONGSTUS https://t.co/rW4AcR4lMW", "【SOMETIMES I CAN’T BREATHE】 \n@tananasho in DEPRESSION \n_\n#DEPRESSIONTRIBE \n#DEPRESSIONVOL2 \n#DRAGONVSTIGER https://t.co/doe5P9iXan", "【IT’S MY LIFE NOT YOURS】 \nim.noblee in DEPRESSION \n_\n#DEPRESSIONTRIBE \n#DEPRESSIONVOL2 \n#DRAGONVSTIGER https://t.co/TZp814XPpV", "【DEPRESSION】\nVOL. 4 Pao Tui Socks\nAvailable in-store &amp; online\n.\n@sects.shop #sectsshop #depressiontribe #depressionvol4", "《D-ANTIDOTE x FILA》\nSS19 The Storm &amp; The Stress \nAvailable in-store &amp; online\n.\n#dantidote #fila #sectsshop #singapore @ Singapore https://t.co/x8uY73zZhW", "《D-ANTIDOTE x FILA》\nSS19 The Storm &amp; The Stress \nAvailable in-store &amp; online\n.\n#dantidote #fila #sectsshop #singapore @ orchardgateway https://t.co/SrYMoijYKF", "《D-ANTIDOTE x FILA》\nSS19 The Storm &amp; The Stress \nAvailable in-store &amp; online\n.\n#dantidote #fila #sectsshop #singapore @ Orchard Road https://t.co/wKbN4EnYWQ"], "media": [null, null, null, null, null, null, null, null, null, null]}, {"id": 310830503, "text": [": Time spent on:\n\n           █          　　\n           █　        \n           █　        \n           █…", ": your crush                  yourself\n   \n                         🤝\n               not liking you", ": My toxic trait? \n\nEating the lunch I brought to work as a snack at 10:00AM", ": only spotify makes playlists for me without asking so i guess i'm dating a music app now and it's pretty cute", ": a relationship with a good flirt to roast ratio &gt;&gt;&gt;", "Clients with no sense of boundaries https://t.co/7YNbtFeyxp", "@TextualOffender ❤️❤️❤️❤️", "s p i r a l l i n g", ": The month of work required to create the stop motion sushi scene in Isle of Dogs #WesAnderson #IsleofDogs https://t.co/3…", ": Every boss everywhere should watch Michelle Williams’ #Emmys speech. Hear it, live it https://t.co/cg8DXminfo"], "media": [null, null, null, null, null, null, null, null, null, "http://pbs.twimg.com/media/EFHOm1aUEAAljnL.jpg"]}, {"id": 3701715556, "text": [": this scene should be in our history books https://t.co/KulSPuZnd3", ": https://t.co/WFimdTYNZO", "watching phantom of the paradise for the first time, how is this movie already my lifeblood and in my dna", ": no person has both:\n\n1. a twitter account\n2. will to live", "@zclavoie honestly, rude", ": every jewish american family recipe seems like a precious heirloom from the old country and then you finally get your hand…", "@motelsiren I’m the hot depressed cat mom so I’d know", "@motelsiren be the hot cat mom you’ve dreamed of", "me @ 4:59pm on Friday https://t.co/XJxhSEGMN1", "@KolleenCarney I wish I got a book deal for mildly observant commentary on men"], "media": ["http://pbs.twimg.com/ext_tw_video_thumb/1015317106919960576/pu/img/MOW_GB3t4uHaYqAk.jpg", "http://pbs.twimg.com/media/EEaC5d-VAAAAJbr.jpg", null, null, null, null, null, null, null, null]}, {"id": 17006157, "text": ["Starting to look like two possible outcomes: Trump and a number of others end up in jail, or thousands of journalists end up in prison camps https://t.co/I9DpBQFwtm", "For those who may not remember, this is the same Steve Schwarzman who compared ending the carried interest loophole to Hitler's invasion of Poland https://t.co/BJwiCTy2Sv", "Again, Dornbusch's law, originally about currency crises but applies perfectly here: the crisis takes longer to happen than you can possibly imagine, then unfolds faster than you can possibly imagine https://t.co/H2ytn0p0ZN", ": I watch the markets, and have been surprised by its non-reaction this week. ⁦@paulkrugman⁩ lays it out.\n\nhttps://t.co/jeoi…", "Gah -- forgot to include Predictit chart 4/ https://t.co/CvHhYG0QQf", "And the reason it will look foolish is because it is. The big problem with Biden is that he really doesn't seem to get what has happened to the GOP over the past 25 years 3/", "Here's why I think this may be bad for Biden: if Trump is impeached, as now seems very likely, but almost all Republicans then vote to acquit, his insistence that Trump is the whole problem and there are lots of good Rs will look foolish 2/", "For what it's worth, prediction markets think Ukraine has boosted Warren against Biden. (Maybe not worth much: Yang with more chance than Sanders or Harris? Really?) They may be right — but NOT because there's any actual Biden scandal 1/", "So Warren-hatred isn't about the threat to the haters' net worth; it's about the threat to their egos. Are they so petty that this will induce them to support a treasonous autocrat? Of course 8/", "And Warren is completely explicit: while she isn't anti-capitalist, she has built her political career on the (true) proposition that at least some great fortunes aren't just rewards for magnificent social contributions, but the result of predation and exploitation 7/"], "media": [null, null, null, null, "http://pbs.twimg.com/media/EFeu4BWXYAIJMlJ.png", null, null, null, null, null]}, {"id": 315799759, "text": ["overthinking killed my happiness,\ninsecurites killed my self esteem,\nlies killed my trust.", "I act like I'm such a strong person but I'm really not.", "i'm sensitive, i over think every little thing, and i care way too much.", "Trying not to cry when your around a bunch of people is literally the worst thing.", "I don't give a shit who you are, you have no right to make someone feel worthless. Just to make yourself feel better!", "when you’re ignored by someone whose attention means the most to you, is the worst feeling. you start to over think and it eats away at you.", "Two things define you. Your patience when you have nothing, and your attitude when you have everything.", "the worst thing about falling to pieces is that humans can do it so quietly.", "I forgive a lot, but I never forget what's said and done!", "Just because the scars have healed, doesn't mean that the pain has."], "media": [null, null, null, null, null, null, null, null, null, null]}, {"id": 1683696416, "text": ["How many people suffer from depression worldwide?", "Inspiring to see male athletes speaking openly about their mental health despite societal pressures to conceal vulnerability @BMarshh #EndTheStigma #KeepTalkingMH\nhttps://t.co/JZuA3xJ3km", "Knowing healthy distress tolerance strategies is so important! What better way to spend #WellnessWednesday than by learning how to self-soothe from this beautiful illustration. https://t.co/E5Ugacbu48", "The DCRP is proud of Dr. Paola Pedrelli for presenting her work on “Evaluating combined treatment versus single-focused treatment for depression and heavy episodic drinking in college students” at the ESBRA conference in France! #CollegeDepression @ppedrelli_paola https://t.co/YiW0jEt19C", "Climate change threatens both our physical and mental wellbeing. Advocating to protect our planet is the first step in changing our future for the better! #ClimateStrike \n\nRead more at:\nhttps://t.co/uPHUj6vtHR via \n@APA https://t.co/Twd2CaiI0P", ": Many individuals quietly bear the symptoms of #mentalhealth conditions without ever showing signs of their illness to others.…", "The best way to support your friend with a mental illness is by listening to and validating their experience! We love this illustration and what it communicates #MentalHealthMatters #SickNotWeak #EndTheStigma https://t.co/dbC1u5jvs0", "#Depressed or down and suffering from a #traumaticbraininjury? Interested in #cognitivebehavioraltherapy #CBT? Interested in learning strategies to improve your #mood? Call 617-724-3222 for more information on our study. https://t.co/bmtrIuHXcT", ": As we remember the tragic events of 9/11 and those we lost, our memories can reactivate the intense emotions felt that day.\n\nThese…", "Know the signs. Know how to help. Know there is hope. #WorldSuicidePreventionDay https://t.co/HJ4GC7F59Q"], "media": [null, null, null, "http://pbs.twimg.com/media/EFQRf_8UUAAb3vc.jpg", "http://pbs.twimg.com/media/EE71YWYVUAAO2fa.jpg", null, null, "http://pbs.twimg.com/media/EESji6RXsAAfwuj.png", null, "http://pbs.twimg.com/media/EEHCtjTUUAQ5CO-.jpg"]}, {"id": 1069242535, "text": ["Our next charity event is December 14th in Old Bridge, NJ and it's that time again! \n\nIf you are looking to sponsor or be a vendor, please contact us via DM or e-mail contact@dropkickdepression.com! \n\nDifferent packages for everyone!", "News coming today regarding October and November leading up to our 12/14 date!", ": Shirts are being mailed today. Only a few left. Grab one while you can. https://t.co/gBIuaQQmvt", ": My shoot job is cool enough to let me donate part of my paycheck to charities I believe in. I picked these two because of a…", ": Okay guys, I didn't realize you guys would actually want the bleach dye tees so much so I apologize but there are only a…", "Do you have any other questions? Reply to this thread and we'll be happy to assist! \n\nWe can't thank you enough for your love and support that has gotten us this far. Now we're here and ready to help the world!", "Q: I want to host a show or other event to benefit Dropkick Depression, how do I do that? \n\nA: Super simple really! You can reach out to us at projects@dropkickdepression.com!", "Q: Can I work for Dropkick Depression?\n\nA: We are always looking for volunteers to help make Dropkick Depression a better place. If you think you have a skill that could help us make the world a better place, please reach out to contact@dropkickdepression.com", "Q: Are you still going to have professional wrestling shows? \n\nA: Of course! We're super excited that 2020 looks like it'll have even more shows than 2019! Information on those will be coming soon. Working on getting our schedule worked out as we speak!", "Q: Can I find any of this information on your website? \n\nA: Of course! Head on over to https://t.co/BD6LLqsjXF to see full details of our programs, financials, and staff members!"], "media": [null, null, null, null, null, null, null, null, null, null]}, {"id": 2291966371, "text": ["Although we can’t see or touch it, depression is an illness that kills.   Just like cancer.  This piece is a powerful illustration.      https://t.co/zGq03xSCtk", "Today, September 10, is the annual World Suicide Prevention Day. This year, World Suicide Prevention Day focuses on the theme of “Working Together to Prevent Suicide,” to emphasize that mental health care and suicide prevention is incumbent on us all. https://t.co/mNyJ9Q43Cl", "Postdoc @Carla_Nasca with @_hdrf Task Force is a finalist for the 2019 Blavatnik Award for Young Scientists.  Her work discovered that a natural chemical in body (acetyl-L-carnitine) rewires brain and is possible new depression treatment. #hopefordepression https://t.co/pbpjrpTqaM", ": Sailor Brinkley Cook &amp; Jack Brinkley Cook Help Race of Hope to Defeat Depression 2019 Break Fundraising Record on Sunday\nht…", "In light of the very sad news about Saoirse Kennedy Hill, we wanted to remind people that depression and mental health issues affect millions of people each year. If you or a loved one need support, please contact the National Suicide Prevention Hotline at 1-800-273-8255.", "\"We are all either struggling or know someone who is battling an illness; let’s come together to make our community more inclusive and comfortable.\" - Saoirse Kennedy Hill. RIP another life lost too soon. https://t.co/uXArNlVVcb", ": Today is the last day to register for the Week of Hope 5k this Sunday in Southampton. Money raised will be put toward depression…", "Beautiful story that dispels myths.  Depression is not grief.  Suicides rise in spring, not during the winter, as opposed to popular belief. If you or someone you love is in crisis, call the National Suicide Prevention Hotline at 1-800-273-8255 https://t.co/XSXrROShgF", ": Want to see our very own @DrSueSwearer in action? She'll join @_hrdf for an important conversation about bullying and me…", "Inspired by the courage and advocacy of Senator Tina Smith of Minnesota #mentalhealthawareness https://t.co/gFX1FyvIap"], "media": [null, null, null, null, null, null, null, null, null, null]}, {"id": 2290644679, "text": [": I'm very excited to share our (w/ @wc_woods) review of the \"Personalized Psychopathology\" field to appear in next year's Annu…", ": Meeting the mental health needs of our students is one of the major challenges facing universities: we need a new approach…", "Very happy to see this news and excited to see how these efforts might help our project that is focused on personalized digital mental health interventions in students. @ADRC_UCLA @UCLAThinkGrand https://t.co/RbkvsQFn8V", "This is a really shocking article - anyone in the field of science/research should give it a read to see an example of how some researchers/editors are still actively standing in the way of truth. https://t.co/r8cWfVu5oU", "@EikoFried https://t.co/eVFDYSgGWv", "@BryonyDuPont That’s Professor Dr with TENURE to them... swear to your heart’s desire! https://t.co/QSasa82hMO", "Congrats to @jonroiser - very exciting development from @wellcometrust! https://t.co/awJ4zTtW5W", "@jd_wilko Following this thread with interest :)", "Everyone should be following @steveschueller ... Amazing work. Awesome human being. Insightful science and treatment twitter commentary on the regular :) https://t.co/LjEWu3YEit", "@tkaiser_science Scott is a coauthor so my strong prior (I’ll read it this week) is that the article is insightful, well written, and convincing. Thanks for the heads up :)"], "media": [null, null, null, null, "http://pbs.twimg.com/tweet_video_thumb/EFPc2NsUUAM_W18.jpg", "http://pbs.twimg.com/tweet_video_thumb/EFPbeNHVUAAiQ0_.jpg", null, null, null, null]}, {"id": 937826478305275904, "text": ["@rainha90214175 Same for you ❤️", "@Deperssion_pain @sadpiixie @BuriedInSorrow @ityaadie @Dimitricelinta2 @diefeelinqs @O_T_hentaipics @C_depressed @arjmxrell @Iostutopia @BeyondBrokenDep @depressedandcut @sosadtoday Felt that", "@rainha90214175 it does get better.", "@sarinmahbod about the same", "I really really wanna cut rn.", "@anonymo73691199 How are you ?", "I’m so so so sorry everyone. I will work hard on getting back to everyone hopefully by tomorrow night! (It’s 8:30pm where I am) - I have been trying to take summer to focus on myself and my happiness. But I’m getting back on this account hopefully.", "@uglygirliyunah I can’t because I am too scared someone will see them. That’s why I don’t cut during the summer.", "@Mariann50326628 I’ve always felt outcast. Other people may think I’m in the right crowd but I never feel that way. I self harm because I like the pain, I like the feeling when I’m numb, and the scars that get left in my skin. But I work everyday to try and change my mindset.", "@LungilePhillips Being not okay is okay. But making an effort to change it is amazing."], "media": [null, null, null, null, null, null, null, null, null, null]}, {"id": 18347686, "text": ["This is so key!! #cureyourdepression https://t.co/9FUZhaoTXw", "#feedback from a #curedepression phone client : \"Wow thank you so much I was not expecting all this it really helps. God bless you! Your my favorite counselor ever! And I have had many:)  I referred you to my friend... https://t.co/zIeFj38780", "#depression and air quality!! Back in 2003, my book talked about this... (US article) https://t.co/4s8ElnrHdn https://t.co/4s8ElnrHdn", "Here’s my #interview with Dr Dave Currie, #comedian Leland Klassen, and his wife Carrie on beating #depression. Share the story :) There is hope! \n\nListen now…\n\nhttps://t.co/4hYMVs4bpv", "For 23 years, #bipolar disorder wreaked havoc for one of Dr Andrew Stoll’s female patients, now a 45 year old woman. She was unable to find adequate treatment for her dangerous peaks of mania and dark... https://t.co/em6nHnueu7", "I did some cleaning up on the website... new photos... https://t.co/8cp86q2VUn :) https://t.co/7lTLwQqAVw", "https://t.co/AWDKcflCQa", "#testimonial for #curedepression : \"I tell everyone who will listen about your site as it has changed my life. Thank you for being such a warrior! Thank you for doing what you do. Thank you for your honesty, hard... https://t.co/C9B4UhJyjv", "Another cool #testimony in my family. A few years ago, my son's teachers began indicating he could have #autism. I was wondering myself! The poor guy was really struggling. So, while waiting for testing, I... https://t.co/9lrdhClzKm", "More Than One #Bipolar Disorder Success Story... https://t.co/nVGvy8PGvI — feeling thankful"], "media": [null, null, null, null, null, null, null, null, null, null]}, {"id": 2822272342, "text": ["Creating A Healing Environment For Patients Suffering From Depression - https://t.co/2tBztQnQFS", "How To Deal With Your Depression And Sadness - https://t.co/XELZpJ6cAc", "Advice For Dealing Successfully With The Difficulties Of Depression - https://t.co/ypBI1dbl62", "How To Deal With Your Symptoms Of Depression - https://t.co/FGKE2kJOOO", "Get Helpful Tips About Depression That Are Simple To Understand - https://t.co/prNBtK49Y2", "Learn About Living Depression Free Here - https://t.co/ruCIM1kRXX", "Advice For Dealing Successfully With The Difficulties Of Depression - https://t.co/ypBI1cTJHs", "Diagnosed With Depression? This Article Can Help You Deal - https://t.co/KifKAXybVt", "Learn How To Deal With Depression - https://t.co/LnARB1Z5KK", "Solid Tips On Depression That Anyone Can Easily Understand - https://t.co/njuRrUDLIl"], "media": [null, null, null, null, null, null, null, null, null, null]}, {"id": 681813, "text": ["@chrisricewriter to this day I always read the hotel evacuation plaque in my room because of these 80s shows...", "@chrisricewriter oh my god. do you remember all the 80s tv episodes about hotel fires??? the silver spoons one TERRIFIED ME https://t.co/1CEezbvIWF", "@chrisricewriter yes! Nancy was like a role model / TV mom to me, along with Judith Light on Who's a Boss", "@chrisricewriter LIVE FOR IT!!! https://t.co/uMZygpxHgE", "@chrisricewriter Sonny decides to write a musical based on Attila the Hun; Ginger's fetish for footwear has a hypnotic effect on Amy.  (!!!!)", "@chrisricewriter A Russian decides to defect to the United States after he falls for Cassie and takes refuge in her locker.", "@chrisricewriter Cassie falls for a millionaire cowboy, who wants Cassie to be a cowgirl if she wants to be with him.", "@chrisricewriter Despite reports of a cat burglar roaming her neighborhood, Lois invites Jan to stay at her home while her husband and children are away. Those plans take an even bigger turn when Vicki, Cassie and Dot insists on turning it into a pajama party, which is crashed by the cat burglar!", "@chrisricewriter You should start tweeting episode summaries to convey the awesomeness, like this:", "@chrisricewriter I would LOVE THIS. Who is your favorite? Cassie obviously right? :)"], "media": [null, null, null, null, null, null, null, null, null, null]}]